In [1]:

import pandas as pd
import numpy as np

In [2]:
lst=[1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
pd.Series(index=['Gunjan','janvi','aditya','arohi'],data=[1,2,3,4])

Gunjan    1
janvi     2
aditya    3
arohi     4
dtype: int64

In [4]:
steps = {'day1' : 4000, 'day2' : 3000, 'day3' : 12000}

pd.Series(steps)

day1     4000
day2     3000
day3    12000
dtype: int64

### Using repeat function along with creating a Series

Pandas Series.repeat() function repeat elements of a Series.<br>It returns a new Series where each element of the current Series is repeated consecutively a given number of times.

In [5]:
pd.Series(3).repeat(5)

0    3
0    3
0    3
0    3
0    3
dtype: int64

we can use the reset function to make the index accurate

In [6]:
pd.Series(5).repeat(3).reset_index(drop=True)

0    5
1    5
2    5
dtype: int64

In [7]:
s=pd.Series([5,4]).repeat([4,2]).reset_index(drop=True)
s

0    5
1    5
2    5
3    5
4    4
5    4
dtype: int64

## Acessing Elements

In [8]:
s[3]

np.int64(5)

s[0] or s[50] something like this would not work becasue the we can access elements based on the index which we procided

In [9]:
s[50]

KeyError: 50

By last n numbers (start - end-1)

In [10]:
s[2:-2]

2    5
3    5
dtype: int64

b) Aggregate function on pandas Series

Pandas Series.aggregate() function aggregate using one or more orations over the specified axis in the given series object.

In [11]:
sr=pd.Series([1,2,3,4,5])
sr.agg([min,max,sum])

C:\Users\Gunjan\AppData\Local\Temp\ipykernel_21840\2558482674.py:2: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sr.agg([min,max,sum])
C:\Users\Gunjan\AppData\Local\Temp\ipykernel_21840\2558482674.py:2: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sr.agg([min,max,sum])
C:\Users\Gunjan\AppData\Local\Temp\ipykernel_21840\2558482674.py:2: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sr.agg([min,max,sum])

min     1
max     5
sum    15
dtype: int64

c) Series absolute function

Pandas Series.abs() method is used to get the absolute numeric value of each element in Series/DataFrame.

In [12]:
sr=pd.Series([1,2,-3,-9,-8,4,5])
sr.abs()

0    1
1    2
2    3
3    9
4    8
5    4
6    5
dtype: int64

d) Appending Series

Pandas Series.append() function is used to concatenate two or more series object.<br> Syntax: Series.append(to_append, ignore_index=False, verify_integrity=False)
<br> Parameter : to_append : Series or list/tuple of Series ignore_index : If True, do not use the index labels. verify_integrity : If True, raise Exception on creating index with duplicates

In [13]:
import pandas as pd

sr1 = pd.Series([1, -2, 3])
sr2 = pd.Series([1, 2, 3])

sr3 = pd.concat([sr2, sr1])  # Use concat instead of append,removed from latest python,used to combine 2 or more series object

print(sr3)

0    1
1    2
2    3
0    1
1   -2
2    3
dtype: int64

To make the index accurate:

In [14]:
sr3.reset_index(drop=True) #reset index and drop old one

0    1
1    2
2    3
3    1
4   -2
5    3
dtype: int64

## e) Astype function

Pandas astype() is the one of the most important methods.<br> It is used to change data type of a series.<br> When data frame is made from a csv file, the columns are imported and data type is set automatically which many times is not what it actually should have.

In [15]:
sr1

0    1
1   -2
2    3
dtype: int64

In [16]:
type(sr1[0])

numpy.int64

In [17]:
sr1.astype('float')

0    1.0
1   -2.0
2    3.0
dtype: float64

## f) Between Function

Pandas between() method is used on series to check which values lie between first and second argument.

In [18]:
sr1=pd.Series([10,12,2,3,7,35])
sr1

0    10
1    12
2     2
3     3
4     7
5    35
dtype: int64

In [19]:
sr1.between(10,40)

0     True
1     True
2    False
3    False
4    False
5     True
dtype: bool

g) All strings functions can be used to extract or modify texts in a series

Upper and Lower Function
 
 Len function
 
 Strip Function
 
 Split Function
 
 Contains Function
 
 Replace Function
 
 Count Function
 
 Startswith and Endswith Function
 
 Find Finction

In [20]:
ser=pd.Series(['gunjan','ved','himanshu','varsha','vasant'])
ser

0      gunjan
1         ved
2    himanshu
3      varsha
4      vasant
dtype: object

In [21]:
ser1=ser.str.lower() #converts words to lowercase
ser1

0      gunjan
1         ved
2    himanshu
3      varsha
4      vasant
dtype: object

In [22]:
ser1=ser.str.upper() #converts words to uppercase
ser1

0      GUNJAN
1         VED
2    HIMANSHU
3      VARSHA
4      VASANT
dtype: object

In [23]:
for i in ser:
    print(len(i))

6
3
8
6
6

Strip Function

In [24]:
ser=pd.Series(["  infosys"," TCS ","  Capegemini"," IBM"]) 
ser

0         infosys
1            TCS
2      Capegemini
3             IBM
dtype: object

In [25]:
for i in ser:
    print(i,len(i))

  infosys 9
 TCS  5
  Capegemini 12
 IBM 4

In [26]:
ser2=ser.str.strip() #strip func removes extra spaces
ser2

0       infosys
1           TCS
2    Capegemini
3           IBM
dtype: object

In [27]:
for i in ser2:
    print(i,len(i))

infosys 7
TCS 3
Capegemini 10
IBM 3

Split Function

In [28]:
ser3=ser.str.split()
ser3

0       [infosys]
1           [TCS]
2    [Capegemini]
3           [IBM]
dtype: object

IF we want to split onlt the first world of every string in the pandas series

In [29]:
ser.str.split()[0]

['infosys']

In [30]:
ser.str.split()[1]

['TCS']

In [31]:
ser=pd.Series(["gunjan@2005","vedant","vasant@1970","varsha"])
ser.str.contains('@') #checks if it contains a string

0     True
1    False
2     True
3    False
dtype: bool

Replace Function

In [32]:
ser.str.replace('@',' ')

0    gunjan 2005
1         vedant
2    vasant 1970
3         varsha
dtype: object

Count Function

In [33]:
ser.str.count('a')

0    1
1    1
2    2
3    2
dtype: int64

startswith and endswith

In [34]:

ser.str.startswith('v')

0    False
1     True
2     True
3     True
dtype: bool

In [35]:
ser.str.endswith('t')

0    False
1     True
2    False
3    False
dtype: bool

In [36]:
ser.str.find('vedant')

0   -1
1    0
2   -1
3   -1
dtype: int64

h) Converting a Series to List

Pandas tolist() is used to convert a series to list. Initially the series is of type pandas.core.series.

In [37]:
ser.to_list()

['gunjan@2005', 'vedant', 'vasant@1970', 'varsha']

Creating a dataframe using List:

DataFrame can be created using a single list or a list of lists.

In [38]:
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']

pd.DataFrame(lst)

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [39]:
lst=[['red',10],['blue',20],['green',30],['yellow',40]]
pd.DataFrame(lst)

        0   1
0     red  10
1    blue  20
2   green  30
3  yellow  40

Creating DataFrame from dict of ndarray/lists:

In [40]:
data={'name':['Radhika','prajwal','kartik','gunjan'],'age':[20,17,21,21]}
pd.DataFrame(data)

      name  age
0  Radhika   20
1  prajwal   17
2   kartik   21
3   gunjan   21

To create DataFrame from dict of narray/list, all the narray must be of same length. If index is passed then the length index should be equal to the length of arrays. If no index is passed, then by default, index will be range(n) where n is the array length.

In [41]:
data={
    'Name'        :['gunjan','radhika','prajwal','kartik'],
    'Age'         :[21,30,27,25],
     'Address'    :['nagpur','pune','mumbai','nashik'],
   'Qualification':['B.tech','PHD','M.tech','Msc'],
}
df=pd.DataFrame(data)
df[['Name','Qualification']]

      Name Qualification
0   gunjan        B.tech
1  radhika           PHD
2  prajwal        M.tech
3   kartik           Msc

##  Slicing in DataFrames Using iloc and loc

In [42]:
data={
    'Name'        :pd.Series(['gunjan','radhika','prajwal','kartik','mani','janhavi']),
    'Age'         :pd.Series([21,30,27,25,34,40]),
     'Address'    :pd.Series(['nagpur','pune','mumbai','nashik','delhi','bangalore']),
   'Qualification':pd.Series(['B.tech','PHD','M.tech','Msc','MA','MBA']),
}
df=pd.DataFrame(data)
df

      Name  Age    Address Qualification
0   gunjan   21     nagpur        B.tech
1  radhika   30       pune           PHD
2  prajwal   27     mumbai        M.tech
3   kartik   25     nashik           Msc
4     mani   34      delhi            MA
5  janhavi   40  bangalore           MBA

## Basic loc Operations

Python loc() function The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select. This method includes the last element of the range passed in it, unlike iloc(). loc() can accept the boolean data unlike iloc(). Many operations can be performed using the loc() method like

In [43]:
df.loc[1:2, 'Name' : 'Age']

      Name  Age
1  radhika   30
2  prajwal   27

## Basic iloc Operations

The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it unlike loc(). iloc() does not accept the boolean data unlike loc().

In [44]:
df.iloc[1:-1,1:-1] #removes 1st row and last row

   Age Address
1   30    pune
2   27  mumbai
3   25  nashik
4   34   delhi

In [45]:
df.iloc[:,2:3] #2:3: means select column index 2 only (start at 2, up to but not including 3).

     Address
0     nagpur
1       pune
2     mumbai
3     nashik
4      delhi
5  bangalore

In [46]:
df.iloc[2:-2] #deletes first 2 rows and last 2 rows

      Name  Age Address Qualification
2  prajwal   27  mumbai        M.tech
3   kartik   25  nashik           Msc

In [47]:
df_new=df[['Age','Address']]
df_new=df.iloc[:,1:3]
df_new

   Age    Address
0   21     nagpur
1   30       pune
2   27     mumbai
3   25     nashik
4   34      delhi
5   40  bangalore

Selecting Specific Rows

In [48]:
df.iloc[[0,2],[1,3]]

   Age Qualification
0   21        B.tech
2   27        M.tech

Slicing Using Conditions

Using Conditions works with loc basically

In [49]:
df.loc[df['Age']>25,['Name','Age']]

      Name  Age
1  radhika   30
2  prajwal   27
4     mani   34
5  janhavi   40

In [50]:
df.loc[df['Age']<25,['Name','Age']]

     Name  Age
0  gunjan   21

### Column Addition in DataFrame

We can add a column in many ways. Let us discuss three ways how we can add column here

* Using List
* Using Pandas Series
* Using an existing Column(we can modify that column in the way we want and that modified part can also be displayed)

In [51]:
l = [22,33,44,55,66,77]
df['five'] = l
df

      Name  Age    Address Qualification  five
0   gunjan   21     nagpur        B.tech    22
1  radhika   30       pune           PHD    33
2  prajwal   27     mumbai        M.tech    44
3   kartik   25     nashik           Msc    55
4     mani   34      delhi            MA    66
5  janhavi   40  bangalore           MBA    77

In [52]:
sr = pd.Series([111,222,333,444])
df['six'] = sr
df

      Name  Age    Address Qualification  five    six
0   gunjan   21     nagpur        B.tech    22  111.0
1  radhika   30       pune           PHD    33  222.0
2  prajwal   27     mumbai        M.tech    44  333.0
3   kartik   25     nashik           Msc    55  444.0
4     mani   34      delhi            MA    66    NaN
5  janhavi   40  bangalore           MBA    77    NaN

Using an existing Column

In [53]:
df['seven'] = df['five'] + 10
df

      Name  Age    Address Qualification  five    six  seven
0   gunjan   21     nagpur        B.tech    22  111.0     32
1  radhika   30       pune           PHD    33  222.0     43
2  prajwal   27     mumbai        M.tech    44  333.0     54
3   kartik   25     nashik           Msc    55  444.0     65
4     mani   34      delhi            MA    66    NaN     76
5  janhavi   40  bangalore           MBA    77    NaN     87

 Column Deletion in Dataframes

In [54]:
del df['six']

df

      Name  Age    Address Qualification  five  seven
0   gunjan   21     nagpur        B.tech    22     32
1  radhika   30       pune           PHD    33     43
2  prajwal   27     mumbai        M.tech    44     54
3   kartik   25     nashik           Msc    55     65
4     mani   34      delhi            MA    66     76
5  janhavi   40  bangalore           MBA    77     87

Using pop

In [55]:
df.pop('five')

df

      Name  Age    Address Qualification  seven
0   gunjan   21     nagpur        B.tech     32
1  radhika   30       pune           PHD     43
2  prajwal   27     mumbai        M.tech     54
3   kartik   25     nashik           Msc     65
4     mani   34      delhi            MA     76
5  janhavi   40  bangalore           MBA     87

In [56]:
df.pop('seven')

df

      Name  Age    Address Qualification
0   gunjan   21     nagpur        B.tech
1  radhika   30       pune           PHD
2  prajwal   27     mumbai        M.tech
3   kartik   25     nashik           Msc
4     mani   34      delhi            MA
5  janhavi   40  bangalore           MBA

In [57]:
df.pop('cgpa')

df

KeyError: 'cgpa'

e) Addition of rows

In a Pandas DataFrame, you can add rows by using the append method. You can also create a new DataFrame with the desired row values and use the append to add the new row to the original dataframe. Here's an example of adding a single row to a dataframe:

In [58]:
df1=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2=pd.DataFrame([[5,6],[7,8]],columns=['a','b'])
df3 = pd.concat([df1,df2]).reset_index(drop = True)
df3

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [59]:
df1=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2=pd.DataFrame([[5,6],[7,8]],columns=['a','b'])
df3 = pd.concat([df2,df1]).reset_index(drop = True)
df3

   a  b
0  5  6
1  7  8
2  1  2
3  3  4

 Pandas drop function

Python is a great language for doing data analysis, primarily because of the fantastic ecosystem of data-centric Python packages. Pandas is one of those packages and makes importing and analyzing data much easier.

Pandas provide data analysts a way to delete and filter data frame using .drop() method. Rows or columns can be removed using index label or column name using this method.

Syntax: DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors=raise)

Parameters:

labels: String or list of strings referring row or column name. axis: int or string value, 0 index for Rows and 1 columns for Columns. index or columns: Single label or list. index or columns are an alternative to axis and cannot be used together. level: Used to specify level in case data frame is having multiple level index. inplace: Makes changes in original Data Frame if True. errors: Ignores error if any value from the list doesnt exists and drops rest of the values when errors = ignore

Return type: Dataframe with dropped values

In [65]:
import pandas as pd

data = { 
    'one'   : pd.Series([1, 2, 3, 4]),
    'two'   : pd.Series([10, 20, 30, 40]),
    'three' : pd.Series([100, 200, 300, 400]),
    'four'  : pd.Series([1000, 2000, 3000, 4000])
}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

axis =0 => Rows (row wise)

In [66]:
df.drop([0,1],axis=0,inplace=True)
df

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

axis=1=>columns (column wise)

In [67]:
df.drop(["three","four"],axis=1,inplace=True)
df

   one  two
2    3   30
3    4   40

## Transposing a DataFrame

In [68]:

data = { 
    'one'   : pd.Series([1, 2, 3, 4]),
    'two'   : pd.Series([10, 20, 30, 40]),
    'three' : pd.Series([100, 200, 300, 400]),
    'four'  : pd.Series([1000, 2000, 3000, 4000])
}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [69]:
df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

A set of more DataFrame Functionalities

In [70]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

ndim function

The .ndim attribute in a Pandas DataFrame returns the number of dimensions of the dataframe, which is always 2 for a DataFrame (row-and-column format).

In [71]:
df.ndim

2

dtypes

The .dtypes attribute in a Pandas DataFrame returns the data types of the columns in the DataFrame. The result is a Series with the column names as index and the data types of the columns as values.

In [72]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

shape function

The .shape attribute in a Pandas DataFrame returns the dimensions (number of rows, number of columns) of the DataFrame as a tuple.

In [73]:
df.shape

(4, 4)

head() function

In [76]:
d={
    'name'  :pd.Series(['gunjan','radhika','kartik','prajwal','mansi','rakesh']),
    'Age'   :pd.Series([21,23,22,20,25,27]),
    'Height':pd.Series([6.24,5.67,6.78,6.54,7.23,6.89])
    
}
df=pd.DataFrame(d)
df

      name  Age  Height
0   gunjan   21    6.24
1  radhika   23    5.67
2   kartik   22    6.78
3  prajwal   20    6.54
4    mansi   25    7.23
5   rakesh   27    6.89

The .head() method in a Pandas DataFrame returns the first n rows (by default, n=5) of the DataFrame. This method is useful for quickly examining the first few rows of a large DataFrame to get a sense of its structure and content.

In [77]:
df.head(3)

      name  Age  Height
0   gunjan   21    6.24
1  radhika   23    5.67
2   kartik   22    6.78

By default it will display first 5 rows<br>
We can mention the number of starting rows we want to see<br>
We will see this function more often furthur since the dataframe is so small at this point so we cannot use something like df.head(20)

df.tail() function

The .tail() method in a Pandas DataFrame returns the last n rows (by default, n=5) of the DataFrame.<br> This method is useful for quickly examining the last few rows of a large DataFrame to get a sense of its structure and content.

In [78]:
df.tail(3)

      name  Age  Height
3  prajwal   20    6.54
4    mansi   25    7.23
5   rakesh   27    6.89

empty function()

In [81]:
df=pd.DataFrame()
df.empty

True

In [82]:
d={
    'name'  :pd.Series(['gunjan','.emptyradhika','kartik','prajwal','mansi','rakesh']),
    'Age'   :pd.Series([21,23,22,20,25,27]),
    'Height':pd.Series([6.24,5.67,6.78,6.54,7.23,6.89])
    
}
df=pd.DataFrame(d)
df.empty

False

## Statistical or Mathematical Functions

Sum 
 
 Mean 
 
 Median 
 
 Mode 
 
 Variance 
 
 Min 
 
 Max 
 
 Standard Deviation

In [83]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [84]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

In [85]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [86]:
df.mode()

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [87]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [88]:
df.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

In [89]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [90]:
df.max()

one         4
two        40
three     400
four     4000
dtype: int64

In [91]:
df.std()

one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64

## Describe Function

The describe() method in a Pandas DataFrame returns descriptive statistics of the data in the DataFrame. It provides a quick summary of the central tendency, dispersion, and shape of the distribution of a set of numerical data.

The default behavior of describe() is to compute descriptive statistics for all numerical columns in the DataFrame. If you want to compute descriptive statistics for a specific column, you can pass the name of the column as an argument.

In [92]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000]),
        'five' : pd.Series(['A','B','C','D'])}


df = pd.DataFrame(data)

df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

## Pipe Functions

The pipe() method in a Pandas DataFrame allows you to apply a function to the DataFrame, similar to the way the apply() method works. The difference is that pipe() allows you to chain multiple operations together by passing the output of one function to the input of the next function.

In [6]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [7]:
def add_(i,j):
    return i+j
df.pipe(add_,10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [8]:
def add_(i,j):
    return i-j
df.pipe(add_,10)

   one  two  three  four
0   -9    0     90   990
1   -8   10    190  1990
2   -7   20    290  2990
3   -6   30    390  3990

In [10]:
def mean_(col):
    return col.mean()
def square(i):
    return i**2
df.pipe(mean_).pipe(square)

one            6.25
two          625.00
three      62500.00
four     6250000.00
dtype: float64

## Apply Function

The apply() method in a Pandas DataFrame allows you to apply a function to the DataFrame, either to individual elements or to the entire DataFrame. The function can be either a built-in Python function or a user-defined function.

In [12]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df
print(df.apply(np.mean))

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [13]:
df.apply(lambda x: x.max() - x.min())

one         3
two        30
three     300
four     3000
dtype: int64

## Apply map function

The map() method in a Pandas DataFrame allows you to apply a function to each element of a specific column of the DataFrame. The function can be either a built-in Python function or a user-defined function.

In [14]:
df.applymap(lambda x : x*100)

C:\Users\Gunjan\AppData\Local\Temp\ipykernel_24980\795461004.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x : x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

applymap and apply are both functions in the pandas library used for applying a function to elements of a pandas DataFrame or Series.

applymap is used to apply a function to every element of a DataFrame. It returns a new DataFrame where each element has been modified by the input function.

apply is used to apply a function along any axis of a DataFrame or Series. It returns either a Series or a DataFrame, depending on the axis along which the function is applied and the return value of the function. Unlike applymap, apply can take into account the context of the data, such as the row or column label.

So, applymap is meant for element-wise operations while apply can be used for both element-wise and row/column-wise operations.

## Reindex Function

The reindex function in Pandas is used to change the row labels and/or column labels of a DataFrame. This function can be used to align data from multiple DataFrames or to update the labels based on new data. The function takes in a list or an array of new labels as its first argument and, optionally, a fill value to replace any missing values. The reindexing can be done along either the row axis (0) or the column axis (1). The reindexed DataFrame is returned.

In [17]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
print(df)
print('-'*30)
print(df.reindex([1,0,3,2]))

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
------------------------------
   one  two  three  four
1    2   20    200  2000
0    1   10    100  1000
3    4   40    400  4000
2    3   30    300  3000

In [18]:
data = {'Name' : ['John', 'Jane', 'Jim', 'Joan'],
        'Age'  : [25, 30, 35, 40],
        'City' : ['New York', 'Los Angeles', 'Chicago', 'Houston']}

df = pd.DataFrame(data)
print(df)
print('-'*30)
print(df.reindex(columns=['Name','City','Age']))

   Name  Age         City
0  John   25     New York
1  Jane   30  Los Angeles
2   Jim   35      Chicago
3  Joan   40      Houston
------------------------------
   Name         City  Age
0  John     New York   25
1  Jane  Los Angeles   30
2   Jim      Chicago   35
3  Joan      Houston   40

 Renaming Columns in Pandas DataFrame

The rename function in Pandas is used to change the row labels and/or column labels of a DataFrame. It can be used to update the names of one or multiple rows or columns by passing a dictionary of new names as its argument. The dictionary should have the old names as keys and the new names as values

In [19]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)

In [20]:
df.rename(columns={'one':'One','two':'Two','three':'Three','four':'Four'},
         inplace=True,index={0:'a',1:'b',2:'c',4:'d'})
df

   One  Two  Three  Four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
3    4   40    400  4000

### Sorting in Pandas DataFrame

Pandas provides several methods to sort a DataFrame based on one or more columns.

sort_values: This method sorts the DataFrame based on one or more columns. The default sorting order is ascending, but you can change it to descending by passing the ascending argument with a value of False.

In [21]:
data = { 'one'   : pd.Series([11, 51, 31, 41]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 500, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0   11   10    100  1000
1   51   20    200  2000
2   31   30    500  3000
3   41   40    400  4000

Sort with respect to Specific Column

In [22]:
df.sort_values(by = 'one', ascending = False)

   one  two  three  four
1   51   20    200  2000
3   41   40    400  4000
2   31   30    500  3000
0   11   10    100  1000

Sort in Specific Order based on multiple Columns

In [23]:
df.sort_values(by = ['one','two'])

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

In [25]:
df.sort_values(by = ['one'], kind = 'heapsort')

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

Groupby Functions

In [56]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}

df = pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [57]:
df.groupby('Team').groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [58]:
df.groupby(['Team','Year']).get_group(('Australia',2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

If the data is not present then we will be getting an error

In [59]:
df.groupby(['Team','Year']).get_group(('Australia',2017))

KeyError: ('Australia', 2017)

Adding some statistical computation on top of groupby

In [60]:
df.groupby('Team').sum()['Points']

Team
Australia    1706
India        2459
NZ           2332
SA           3218
Name: Points, dtype: int64

This means we have displayed the teams which are having the maximum sum in Poitns

In [61]:
df.groupby('Team').sum()['Points'].sort_values(ascending=False)

Team
SA           3218
India        2459
NZ           2332
Australia    1706
Name: Points, dtype: int64

Checking multiple stats for points team wise

In [62]:
groups = df.groupby('Team')

groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min])

C:\Users\Gunjan\AppData\Local\Temp\ipykernel_24980\465911169.py:3: FutureWarning: The provided callable <function sum at 0x0000028D74191D00> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min])
C:\Users\Gunjan\AppData\Local\Temp\ipykernel_24980\465911169.py:3: FutureWarning: The provided callable <function mean at 0x0000028D74193100> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min])
C:\Users\Gunjan\AppData\Local\Temp\ipykernel_24980\465911169.py:3: FutureWarning: The provided callable <function std at 0x0000028D74193240> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min])
C:\Users\Gunjan\AppData\Local\Temp\ipykernel_24980\465911169.py:3: FutureWarning: The provided callable <function max at 0x0000028D74192700> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min])
C:\Users\Gunjan\AppData\Local\Temp\ipykernel_24980\465911169.py:3: FutureWarning: The provided callable <function min at 0x0000028D74192840> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min])

            sum        mean        std  max  min
Team
Australia  1706  853.000000  53.740115  891  815
India      2459  819.666667  49.702448  876  782
NZ         2332  777.333333  97.449132  883  691
SA         3218  804.500000  28.769196  834  776

filter function along with groupby

In [63]:
df.groupby('Team').filter(lambda x : len(x) == 4)

  Team  Rank  Year  Points
4   SA     3  2014     776
5   SA     4  2015     784
6   SA     1  2016     834
7   SA     1  2017     824

The data of South Africa are present equal to 4 times that is why South Africa is being displayed here

In [64]:
df.groupby('Team').filter(lambda x : len(x) == 3)

     Team  Rank  Year  Points
0   India     2  2014     876
1   India     3  2015     801
8      NZ     2  2016     758
9      NZ     4  2014     691
10     NZ     1  2015     883
11  India     2  2017     782

 ## Working with csv files and basic data Analysis Using Pandas

Reading csv

In [65]:
df = pd.read_csv('Football.csv')

df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [66]:
link = 'https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv'
# df = pd.read_csv(link)
# df.head()

## Pandas Info Function

Pandas dataframe.info() function is used to get a concise summary of the dataframe. It comes really handy when doing exploratory analysis of the data. To get a quick overview of the dataset we use the dataframe.info() function.

Syntax: DataFrame.info(verbose=None, buf=None, max_cols=None, memory_usage=None, null_counts=None)

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 660 entries, 0 to 659
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  660 non-null    object
 1   League                   660 non-null    object
 2   Club                     626 non-null    object
 3   Player Names             660 non-null    object
 4   Matches_Played           660 non-null    int64
 5   Substitution             660 non-null    int64
 6   Mins                     660 non-null    int64
 7   Goals                    660 non-null    int64
 8   xG                       660 non-null    float64
 9   xG Per Avg Match         660 non-null    float64
 10  Shots                    660 non-null    int64
 11  OnTarget                 660 non-null    int64
 12  Shots Per Avg Match      660 non-null    float64
 13  On Target Per Avg Match  660 non-null    float64
 14  Year                     660 non-null    int64
dtypes: float64(4), int64(7), object(4)
memory usage: 77.5+ KB

c) isnull() function to check if there are nan values present

In [68]:
df.isnull()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
656,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
657,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
658,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False
659,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

If we use the sum function along with it then we can get how many null values are present in each columns

In [69]:
df.isnull().sum()

Country                     0
League                      0
Club                       34
Player Names                0
Matches_Played              0
Substitution                0
Mins                        0
Goals                       0
xG                          0
xG Per Avg Match            0
Shots                       0
OnTarget                    0
Shots Per Avg Match         0
On Target Per Avg Match     0
Year                        0
dtype: int64

d) Quantile function to get the specific percentile value

In [70]:
df.describe(percentiles = [.80])

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
80%,32.000000,6.000000,2915.800000,15.000000,14.076000,0.610000,90.000000,39.000000,3.600000,1.630000,2020.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000

Let us use the quantile function to get the exact value now

In [72]:
df['Mins'].quantile(.80)

np.float64(2915.8)

## isnull() function to check if there are nan values present

df.isnull()

So we can see we are getting a boolean kind of a table giving True and False

If we use the sum function along with it then we can get how many null values are present in each columns

In [74]:
df.isnull().sum()

Country                     0
League                      0
Club                       34
Player Names                0
Matches_Played              0
Substitution                0
Mins                        0
Goals                       0
xG                          0
xG Per Avg Match            0
Shots                       0
OnTarget                    0
Shots Per Avg Match         0
On Target Per Avg Match     0
Year                        0
dtype: int64

Quantile function to get the specific percentile value

Copy function

If we normal do:
de=df
Then a change in de will affect the data of df as well so we need to copy in such a way that it creates a totally new object and does not affect the old dataframe

In [78]:
de = df.copy()
de.head(3)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016

In [79]:
de['Year+100'] = de['Year'] + 100
de.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year,Year+100
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016,2116
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016,2116
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016,2116
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016,2116
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016,2116

## Value Counts function

Pandas Series.value_counts() function return a Series containing counts of unique values. The resulting object will be in descending order so that the first element is the most frequently-occurring element. Excludes NA values by default.

Syntax: Series.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)

In [80]:
df['Player Names'].value_counts()

Player Names
Lionel Messi          5
Luis Suarez           5
Fabio Quagliarella    5
Andrea Belotti        5
Robert Lewandowski    5
                     ..
Robson                1
Renato Kayzer         1
Donny van de Beek     1
Teun Koopmeiners      1
Cantalapiedra         1
Name: count, Length: 444, dtype: int64

Unique and Nunique Function

While analyzing the data, many times the user wants to see the unique values in a particular column, which can be done using Pandas unique() function.

In [81]:
df['Player Names'].unique()

array(['Juanmi Callejon', 'Antoine Griezmann', 'Luis Suarez',
       'Ruben Castro', 'Kevin Gameiro', 'Cristiano Ronaldo',
       'Karim Benzema', 'Neymar ', 'Iago Aspas', 'Sergi Enrich',
       'Aduriz ', 'Sandro Ramlrez', 'Lionel Messi', 'Gerard Moreno',
       'Morata', 'Wissam Ben Yedder', 'Willian Jose', 'Andone ',
       'Cedric Bakambu', 'Isco', 'Mohamed Salah', 'Gregoire Defrel',
       'Ciro Immobile', 'Nikola Kalinic', 'Dries Mertens',
       'Alejandro Gomez', 'Jose CallejOn', 'Iago Falque',
       'Giovanni Simeone', 'Mauro Icardi', 'Diego Falcinelli',
       'Cyril Thereau', 'Edin Dzeko', 'Lorenzo Insigne',
       'Fabio Quagliarella', 'Borriello ', 'Carlos Bacca',
       'Gonzalo Higuain', 'Keita Balde', 'Andrea Belotti', 'Fin Bartels',
       'Lars Stindl', 'Serge Gnabry', 'Wagner ', 'Andrej Kramaric',
       'Florian Niederlechner', 'Robert Lewandowski', 'Emil Forsberg',
       'Timo Werner', 'Nils Petersen', 'Vedad Ibisevic', 'Mario Gomez',
       'Maximilian Philipp', 'A\x81dam Szalai',
       'Pierre-Emerick Aubameyang', 'Guido Burgstaller', 'Max Kruse',
       'Chicharito ', 'Anthony Modeste', 'Arjen Robben', 'Alexis Sanchez',
       'Romelu Lukaku', 'Harry Kane', 'Jamie Vardy', 'Christian Benteke',
       'Pedro None', 'Eden Hazard', 'Roberto Firmino', 'Sadio Mane',
       'Philippe Coutinho', 'Diego Costa', 'Dele Alli', 'Sergio Aguero',
       'Jermain Defoe', 'Fernando Llorente', 'Michail Antonio',
       'Zlatan Ibrahimovic', 'Olivier Giroud', 'Son Heung-Min',
       'Joshua King', 'Diego Souza', 'Pablo ', 'Robinho ', 'Kempes ',
       'Gabriel Jesus', 'Bruno Rangel ', 'Rogerio ', 'Vitor Bueno',
       'Marinho ', 'Grafite ', 'Andres Chavez', 'Cicero Semedo', 'Sassa',
       'Giorgian de Arrascaeta', 'Keno ', 'Fred ', 'Kleber Gladiador',
       'Pottker ', 'Jonathan Copete', 'Ricardo Oliveira',
       'Angel Rodriguez', 'Gareth Bale', 'Rodrigo None', 'Sergio Leon',
       'Maxi Gomez', 'Mikel Oyarzabal', 'Willian Josa', 'Simone Zaza',
       'Portu ', 'Cristhian Stuani', 'Santi Mina', 'Morales ', 'Munir ',
       'Jose Callejon', 'Sergej Milinkovic-Savic', 'Duvan Zapata',
       'Paulo Dybala', 'Mirco Antenucci', 'Luis Alberto',
       'Roberto Inglese', 'Josip Ilicic', 'Ivan Perisic',
       'Leonardo Pavoletti', 'Kevin Lasagna', 'Niclas Fullkrug',
       'Salomon Kalou', 'Thorgan Hazard', 'Jean-Kevin Augustin',
       'Sandro Wagner ', 'Leon Bailey', 'Daniel Didavi',
       'Alfred Finnbogason', 'Davie Selke', 'Mark Uth',
       'Michael Gregoritsch', 'Julian Brandt', 'Kevin Volland', 'Roger ',
       'Arthur Caike', 'Everton ', 'Hernanes ', 'Luiz Fernando',
       'Wellington Paulista', 'Santiago Trellez', 'Jo', 'Thiago Neves',
       'Bruno Henrique', 'Dudu ', 'Diego ', 'Lucca ', 'Henrique Dourado',
       'Andre', 'Edigar Junio ', 'Junior  Dutra', 'Jaime Mata',
       'Inaki Williams', 'Chimy Avila', 'Raul de Tomas', 'Pablo Sarabia',
       'Borja Iglesias', 'Jorge Molina', 'Charles', 'Arkadiusz Milik',
       'Mandzukic None', 'Andrea Petagna', 'Francesco Caputo',
       'Stephan El Shaarawy', 'Gervinho ', 'Krzysztof Piatek',
       'Alassane Plea', 'Kai Havertz', 'Luka Jovic', 'Ante Rebic',
       'Jadon Sancho', 'Ondrej Duda', 'Paco Alcacer', 'Benito Raman',
       'Wout Weghorst', 'Ishak Belfodil', 'Marco Reus',
       'Jean-Philippe Mateta', 'Sebastien Haller', 'Yussuf Poulsen',
       'Angel Di Maria', 'Remi Oudin', 'Nicolas Pepe', 'Emiliano Sala',
       'Jonathan Bamba', "M'Baye Niang", 'Edinson Cavani',
       'Stephane Bahoken', 'Max Gradel', 'Florian Thauvin',
       'Kylian Mbappe-Lottin', 'Wahbi Khazri', 'Falcao ',
       'Gaetan Laborde', 'Andy Delort', 'Moussa Dembele', 'Memphis Depay',
       'Lebo Mothiba', 'Francois Kamano', 'Luka Milivojevic',
       'Paul Pogba', 'Ashley Barnes', 'Glenn Murray', 'Richarlison ',
       'Callum Wilson', 'Gylfi Sigurdsson', 'Raheem Sterling',
       'Ayoze Perez', 'Alexandre Lacazette', 'Raul Jimenez',
       'Lucas Paqueta', 'Juan Cazares', 'Deyverson ', 'Leandro Damiao ',
       'Yago Pikachu', 'Rodrygo ', 'Andres Rios', 'Roger Guedes ',
       'Leandro Pereira ', 'Pedro ', 'Nico Lupez', 'Nene ', 'Gilberto ',
       'Henrique ', 'Willian ', 'Gabriel Barbosa', 'Diego Rossi',
       'Josef Martinez', 'Chris Wondolowski', 'Nani ', 'Kacper Przybylko',
       'Kei Kamara', 'C.J. Sapong', 'Gyasi Zardes', 'Heber ',
       'Mauro Manotas', 'Brian Fernandez', 'Alejandro Pozuelo',
       'Felipe Gutierrez', 'Jordan Morris', 'Raul Ruidiaz',
       'Jozy Altidore', 'Carlos Vela', 'Nemanja Nikolic',
       'Alexandru Mitrita', 'Joselu', 'Carlos Fernandez', 'Ante Budimir',
       'Lucas Perez', 'Loren Moron', 'Raul Garcla', 'Morata ',
       'Sergio Ramos', 'Lucas Ocampos', 'Cazorla ', 'Pote ',
       'Tiquinho Soares', 'Eduardo Mancha', 'Paulinho ', 'Alex Telles',
       'Bruno Viana', 'Mehrdad Mohammadi', 'Carlos Valenzuela',
       'Ruben Lameiras', 'Moussa Marega', 'Gian-Luca Waldschmidt',
       'Samuel Lino', 'Andre Andre', 'Mehdi Taremi', 'Carlos Vinicius',
       'Sergio Oliveira', 'Douglas Tanque', 'Fabio Abreu',
       'Brayan Riascos', 'Alex Telles ', 'Fabio Martins',
       'Haris  Seferovic', 'Joao Teixeira', 'Bruno Fernandes',
       'Angel Gomes', 'Toni Mart\xadnez', 'Pizzi ', 'Bozhidar Kraev',
       'Sandro Lima', 'Rodrigo Pinho', 'Thiago Santana', 'Trincao ',
       'Andraz Sporar', 'Ricardo Horta', 'Bruno Duarte', 'Nuno Santos',
       'Domenico Berardi', 'Joao Pedro', 'Andreas Cornelius',
       'Marco Mancosu', 'Lautaro Martrinez', 'Luis Muriel',
       'Gianluca Lapadula', 'Marcus Thuram', 'Rouwen Hennings',
       'Andre Silva', 'Erling Haaland', 'Jhon Cordoba', 'Robin Quaison',
       'Sebastian Andersson', 'Dimitri Payet', 'Kasper Dolberg',
       'Adrien Thomasson', 'Dario Benedetto', 'Ludovic Ajorque',
       'Islam Slimani', 'Adrien Hunou', 'Denis Bouanga',
       'Sehrou Guirassy', '\x81ngel Di Maria', 'Habib Diallo',
       'Victor Osimhen', 'Dominic Calvert-Lewin', 'Kevin De Bruyne',
       'Chris Wood', 'Anthony Martial', 'Riyad Mahrez', 'Marcus Rashford',
       'Danny Ings', 'Richarlison  ', 'Teemu Pukki', 'Tammy Abraham',
       'Thiago Galhardo', 'Paolo Guerrero', 'Pepe', 'Michael ',
       'Carlos Sanchez', 'Everaldo ', 'Artur ', 'Marcelo  Cirino',
       'Yeferson Soteldo', 'Eduardo Sasha', 'Rafael Moura', 'Antony None',
       'Quincy Promes', 'Dusan Tadic', 'Armando Broja', 'Steven Berghuis',
       'Michael de Leeuw', 'Lois Openda', 'Danilo Nome', 'Lennart Thy',
       'Donyell Malen', 'Noni Madueke', 'Davy Klaassen',
       'Oussama Tannane', 'Vaclav Cerny', 'Vangelis Pavlidis',
       'Henk Veerman', 'Abdou Harroui', 'Rai Vloet', 'Lassina Traore',
       'Georgios Giakoumakis', 'Alex Pozuelo', 'Kevin Molino',
       'Damir Kreilach', 'Bradley Wright-Phillips', 'Nicolas Lodeiro',
       'Daryl Dike', 'Cristian Pavon', 'Chris Mueller', 'Romell Quioto',
       'Gustavo Bou', 'Robert Beric', 'Ayo Akinola', 'Jeremy Ebobisse',
       'Diego Valeri', 'Youssef   En-Nesyri', 'Carlos Soler',
       'Cristian Tello', 'Esteban Burgos', 'Joao Felix',
       'Federico Valverde', 'Kike GarcIa', 'Ansu Fati', 'Roberto Soriano',
       'Gaetano Castrovilli', 'Henrikh Mkhitaryan', 'Jordan Veretout',
       'Lautaro MartInez', 'Hirving Lozano', 'Lucas Alario', 'Bas Dost',
       'Dani Olmo', 'Ellyes Skhiri', 'Thomas Muller', 'Andre Hahn',
       'Daniel Caligiuri', 'Matheus Cunha', 'Ludovic Blas', 'Karl Toko',
       'Burak Yilmaz', 'Ibrahima Niane', 'Boulaye Dia', 'Moise Kean',
       'Ignatius Ganago', 'Irvin Cardona', 'Wissam Ben', 'Amine Gouiri',
       'Mama Balde', 'Gael Kakuta', 'James Ward-Prowse', 'Diogo Jota',
       'Wilfried Zaha', 'Jack Grealish', 'Jarrod Bowen',
       'Patrick Bamford', 'Danny Ings ', 'Neal Maupay', 'Ollie Watkins',
       'Luciano ', 'Vinicius ', 'Raphael Veiga', 'Luiz Adriano',
       'Cleber ', 'German Cano', 'Brenner None', 'Matheus Babi',
       'Alerrandro ', 'Claudinho ', 'Robson', 'Renato Kayzer',
       'Donny van de Beek', 'Teun Koopmeiners', 'Cantalapiedra ',
       'Bryan Linssen', 'Matavz ', 'Oussama Idrissi', 'Chidera Ejuke',
       'Myron Boadu', 'Klaas-Jan Huntelaar', 'Haris Vuckic',
       'Gyrano Kerk', 'Denzel Dumfries', 'Cyriel Dessers ', 'Cody Gakpo'],
      dtype=object)

While analyzing the data, many times the user wants to see the unique values in a particular column. Pandas nunique() is used to get a count of unique values.

In [82]:
df['Player Names'].nunique()

444

 dropna() function

Sometimes csv file has null values, which are later displayed as NaN in Data Frame. Pandas dropna() method allows the user to analyze and drop Rows/Columns with Null values in different ways.

Syntax:

DataFrameName.dropna(axis=0,inplace=False)

In [83]:
link = 'https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv'

df = pd.read_csv(link)
df.head()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

In [84]:
df.isnull().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

ok so it seems like we have alot of Null Values in column Rating and few null values in some other columns

In [86]:
df.dropna(inplace = True, axis = 0) #deletes all rows containing null rows
df

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10834,FR Calculator,FAMILY,4.0,7,2.6M,500+,Free,0,Everyone,Education,"June 18, 2017",1.0.0,4.1 and up
10836,Sya9a Maroc - FR,FAMILY,4.5,38,53M,"5,000+",Free,0,Everyone,Education,"July 25, 2017",1.48,4.1 and up
10837,Fr. Mike Schmitz Audio Teachings,FAMILY,5.0,4,3.6M,100+,Free,0,Everyone,Education,"July 6, 2018",1.0,4.1 and up
10839,The SCP Foundation DB fr nn5n,BOOKS_AND_REFERENCE,4.5,114,Varies with device,"1,000+",Free,0,Mature 17+,Books & Reference,"January 19, 2015",Varies with device,Varies with device
10840,iHoroscope - 2018 Daily Horoscope & Astrology,LIFESTYLE,4.5,398307,19M,"10,000,000+",Free,0,Everyone,Lifestyle,"July 25, 2018",Varies with device,Varies with device

This will delete all the rows which are containing the null values

In [89]:
df.dropna(inplace = True, axis = 1) #deletes all columns containing null column
df

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10834,FR Calculator,FAMILY,4.0,7,2.6M,500+,Free,0,Everyone,Education,"June 18, 2017",1.0.0,4.1 and up
10836,Sya9a Maroc - FR,FAMILY,4.5,38,53M,"5,000+",Free,0,Everyone,Education,"July 25, 2017",1.48,4.1 and up
10837,Fr. Mike Schmitz Audio Teachings,FAMILY,5.0,4,3.6M,100+,Free,0,Everyone,Education,"July 6, 2018",1.0,4.1 and up
10839,The SCP Foundation DB fr nn5n,BOOKS_AND_REFERENCE,4.5,114,Varies with device,"1,000+",Free,0,Mature 17+,Books & Reference,"January 19, 2015",Varies with device,Varies with device
10840,iHoroscope - 2018 Daily Horoscope & Astrology,LIFESTYLE,4.5,398307,19M,"10,000,000+",Free,0,Everyone,Lifestyle,"July 25, 2018",Varies with device,Varies with device

##  Fillna Function

Pandas Series.fillna() function is used to fill NA/NaN values using the specified method.
Suppose if we want to fill the null values with something instead of removing them then we can use fillna function
Here we will be filling the numerical columns with its mean values and Categorical columns with its mode

In [90]:
link = 'https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv'

df = pd.read_csv(link)

print(len(df))

10841

Numerical columns

In [91]:
mis = round(df['Rating'].mean(),2)

df['Rating'] = df['Rating'].fillna(mis)

print(len(df))

10841

If we would have used inplace=True then it would have permenantly stored those values in our dataframe

Categorical values

In [92]:
df['Current Ver'] = df['Current Ver'].fillna('Varies on Device')

 sample function

Pandas sample() is used to generate a sample random row or column from the function caller data frame.

In [93]:
df.sample(5)

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
7496,Camera V7 24 Megapixel,PHOTOGRAPHY,4.00,2480,2.5M,"100,000+",Free,0,Everyone,Photography,"August 1, 2018",4.0,4.1 and up
9412,ei,COMMUNICATION,4.19,2,4.5M,10+,Free,0,Teen,Communication,"July 16, 2018",0.0.10,4.4 and up
8162,MYTO CZ,MAPS_AND_NAVIGATION,2.90,30,4.8M,"5,000+",Free,0,Everyone,Maps & Navigation,"February 17, 2016",1.2,4.1 and up
504,BLK - Swipe. Match. Chat.,DATING,4.10,2067,24M,"100,000+",Free,0,Mature 17+,Dating,"July 25, 2018",1.6.1,4.4 and up
8334,Noticias DF,SOCIAL,4.19,2,2.3M,"1,000+",Free,0,Everyone,Social,"May 25, 2015",1.0,2.3 and up

 to_csv() function

Pandas Series.to_csv() function write the given series object to a comma-separated values (csv) file/format.

Syntax: Series.to_csv(*args, **kwargs)

In [95]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)

df.to_csv('Numbers.csv')

We got an extra Unnamed:0 Column if we want to avoid that we need to add an extra parameter mentioning index=False

In [96]:
df.to_csv('Number.csv', index = False)

 A detailed Pandas Profile report

The pandas_profiling library in Python include a method named as ProfileReport() which generate a basic report on the input DataFrame.

The report consist of the following:

DataFrame overview, Each attribute on which DataFrame is defined, Correlations between attributes (Pearson Correlation and Spearman Correlation), and A sample of DataFrame.